{"body": [{"indent": 0, "text": ["Subnetwork"], "type": "title", "level": 0}, {"indent": 0, "type": "summary", "text": ["The Subnet op is essentially a way of creating a macro to represent a collection of ops as a single op in the Network Editor."]}, {"indent": 0, "type": "para", "text": ["The Subnet op is essentially a way of creating a macro to represent a\ncollection of ops as a single op in the Network Editor. The Subnet op\ncan contain an entire op Network within it, stream-lining and\nsimplifying your op network both visually and conceptually."]}, {"indent": 0, "type": "para", "text": ["Selecting Edit SubNetwork… from the op’s pop-up menu presents you\nwith a new Network Editor with four subnetwork inputs. These four\ninputs are connected directly to the four inputs on the Subnet op in\nyour original network. Proceed by attaching ops as required to these\nfour subnetwork inputs. The display op will be wired back to the output\nconnector of the Subnet op in your original op network. To get back to\nthe original op network, go up a level (type ", {"keys": ["U"], "text": null, "type": "keys"}, ")."]}, {"indent": 0, "type": "para", "text": ["Please refer to ", {"text": ["subnetworks"], "fullpath": "/network/organize", "scheme": null, "type": "link", "value": "/network/organize"}, "  for a complete\ndiscussion and an example of how to use subnetworks."]}, {"body": [{"body": [{"indent": 4, "type": "para", "text": ["Select several Operators that you want to make into a subnetwork,\n    and select Collapse Selected from the OP’s pop-up menu to\n    automatically create a subnetwork out of them. You will see the\n    selected Operators replaced by a single Subnetwork op, and it will\n    be properly rewired to contain the previously selected ops."]}], "indent": 0, "role": "item", "type": "tip"}], "container": true, "role": "item_group", "type": "tip_group"}], "summary": ["The Subnet op is essentially a way of creating a macro to represent a collection of ops as a single op in the Network Editor."], "type": "root", "attrs": {"tags": "network, util", "internal": "subnet", "type": "node", "context": "sop", "icon": "COMMON/subnet"}, "title": ["Subnetwork"]}