{"body": [{"body": [{"body": [{"indent": 4, "type": "para", "text": ["Controls the way in which the data created by this node is shared\n    among multiple objects in the simulation. "]}, {"indent": 4, "type": "para", "text": ["Data sharing can greatly\n    reduce the memory footprint of a simulation, but at the expense of\n    requiring all objects to have exactly the same data associated with\n    them."]}, {"body": [{"body": [{"indent": 8, "type": "para", "text": ["No data sharing is used. Each object has its own copy of the\n        data attached. "]}, {"indent": 8, "type": "para", "text": ["This is appropriate for situations where the data\n        needs to be customized on a per-object basis, such as setting up\n        initial positions and velocities for objects."]}], "indent": 4, "type": "dt", "text": ["Do Not Share Data "]}, {"body": [{"indent": 8, "type": "para", "text": ["This node only creates a single piece of data for the whole\n        simulation. This data is created the first time it is needed, so\n        any expressions will be evaluated only for the first object. "]}, {"indent": 8, "type": "para", "text": ["All\n        subsequent objects will have the data attached with the same\n        values that were calculated from the expressions for the first\n        object. It is important to note that expressions are not stored\n        with the data, so they cannot be evaluated after the data is\n        created. "]}, {"indent": 8, "type": "para", "text": ["Expressions are evaluated by the DOP node before\n        creating the data. Expressions involving time will also only be\n        evaluated when this single piece of data is created. This option\n        is appropriate for data that does not change over time, and is\n        the same for all objects, such as a ", {"text": ["Gravity\n        DOP"], "fullpath": "/nodes/dop/gravity", "scheme": "Node", "type": "link", "value": "/nodes/dop/gravity"}, "."]}], "indent": 4, "type": "dt", "text": ["Share Data Across All Time "]}, {"body": [{"indent": 8, "type": "para", "text": ["A new piece of data is created for each timestep in the\n        simulation. Within a timestep though, all objects have the same\n        data attached to them. So expressions involving time will cause\n        this data to animate over time, but expressions involving the\n        object will only evaluate for the first object to which the data\n        is attached. "]}, {"indent": 8, "type": "para", "text": ["This option is appropriate for data that changes\n        over time, but is the same for all objects such as a ", {"text": ["Fan Force\n        DOP"], "fullpath": "/nodes/dop/fan", "scheme": "Node", "type": "link", "value": "/nodes/dop/fan"}, ", where the fan may move or rotate over time."]}], "indent": 4, "type": "dt", "text": ["Share Data In One Timestep "]}], "container": true, "type": "dt_group"}], "indent": 0, "type": "dt", "text": ["Data Sharing"]}], "container": true, "type": "dt_group"}], "type": "root", "attrs": {"type": "include"}}